tests/fixtures/Subscription/subscription.canceled_after_trial.json

{
  "id": "sub_3ce7tY0vtbIAjb",
  "plan": {
    "interval": "month",
    "name": "Personal",
    "created": 1371118751,
    "amount": 900,
    "currency": "gbp",
    "id": "personal-9",
    "object": "plan",
    "livemode": false,
    "interval_count": 1,
    "trial_period_days": null,
    "metadata": {}
  },
  "object": "subscription",
  "start": 1394201972,
  "status": "canceled",
  "customer": "cus_3cbU7OeaCpcS9D",
  "cancel_at_period_end": false,
  "current_period_start": 1394201972,
  "current_period_end": 1396880372,
  "ended_at": 1396880375,
  "trial_start": null,
  "trial_end": null,
  "canceled_at": 1396880375,
  "quantity": 1,
  "application_fee_percent": null,
  "discount": null
}
